In [63]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

gdp_df = pd.read_csv('data\gdp_percapita.csv', nrows = 6606 )

In [64]:
gdp_df

     Country or Area  Year        Value  Value Footnotes
0        Afghanistan  2018  2190.240321              NaN
1        Afghanistan  2017  2202.570851              NaN
2        Afghanistan  2016  2200.764487              NaN
3        Afghanistan  2015  2212.750899              NaN
4        Afghanistan  2014  2249.253738              NaN
...              ...   ...          ...              ...
6601        Zimbabwe  1994  3263.934978              NaN
6602        Zimbabwe  1993  3033.504852              NaN
6603        Zimbabwe  1992  3054.889178              NaN
6604        Zimbabwe  1991  3426.598094              NaN
6605        Zimbabwe  1990  3324.348171              NaN

[6606 rows x 4 columns]

6. Repeat for the internet use dataset. Call this DataFrame internet_df. Take a look at the first six rows.

In [65]:
internet_df = pd.read_csv('data\internet_use.csv', nrows = 4495)
internet_df

     Country or Area  Year     Value  Value Footnotes
0        Afghanistan  2014  6.390000              NaN
1        Afghanistan  2013  5.900000              NaN
2        Afghanistan  2012  5.454545              NaN
3        Afghanistan  2011  5.000000              NaN
4        Afghanistan  2010  4.000000              NaN
...              ...   ...       ...              ...
4490        Zimbabwe  1997  0.033080              NaN
4491        Zimbabwe  1996  0.016790              NaN
4492        Zimbabwe  1995  0.007684              NaN
4493        Zimbabwe  1994  0.001739              NaN
4494        Zimbabwe  1990  0.000000              NaN

[4495 rows x 4 columns]

I ran into lots of issues because of how I tried to deal with the tokenization error.  My method for dealing with it led me to eliminating all of the columns...which I didn't realize would be an issue until I got to #10.  luckily went to a breakout room with Richie who set me straight. :)

also, I opened a new notebook when I began BEFORE i downloaded the data...I was following along when Rachel volunteered. This forced me to have a super long directory path in my read_csv().  I went back and redid it so it was neater...took me a while to copy and paste everything which is why I only got to number 12 today(SAT april 3).

5. Using the pandas read_csv() method, read the GDP dataset into your notebook as a DataFrame called gdp_df. Take a look at the first 6 rows.

In [66]:
gdp_df.head(6)

  Country or Area  Year        Value  Value Footnotes
0     Afghanistan  2018  2190.240321              NaN
1     Afghanistan  2017  2202.570851              NaN
2     Afghanistan  2016  2200.764487              NaN
3     Afghanistan  2015  2212.750899              NaN
4     Afghanistan  2014  2249.253738              NaN
5     Afghanistan  2013  2264.317575              NaN

6. Repeat for the internet use dataset. Call this DataFrame internet_df. Take a look at the first six rows.

In [67]:
internet_df.head(6)

  Country or Area  Year     Value  Value Footnotes
0     Afghanistan  2014  6.390000              NaN
1     Afghanistan  2013  5.900000              NaN
2     Afghanistan  2012  5.454545              NaN
3     Afghanistan  2011  5.000000              NaN
4     Afghanistan  2010  4.000000              NaN
5     Afghanistan  2009  3.550000              NaN

7. Look at the shape of each DataFrame - how many rows? How many columns?

In [68]:
print(gdp_df.shape)
print(internet_df.shape)

(6606, 4)
(4495, 4)

8. Take a look at the datatypes for the columns in each DataFrame.

In [69]:
gdp_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

In [70]:
internet_df.dtypes

Country or Area     object
Year                 int64
Value              float64
Value Footnotes    float64
dtype: object

9. Take a look at the last 10 rows of each DataFrame in turn.

In [71]:
gdp_df.tail(10)

     Country or Area  Year        Value  Value Footnotes
6596        Zimbabwe  1999  3600.849291              NaN
6597        Zimbabwe  1998  3653.920016              NaN
6598        Zimbabwe  1997  3580.048793              NaN
6599        Zimbabwe  1996  3520.430146              NaN
6600        Zimbabwe  1995  3226.413930              NaN
6601        Zimbabwe  1994  3263.934978              NaN
6602        Zimbabwe  1993  3033.504852              NaN
6603        Zimbabwe  1992  3054.889178              NaN
6604        Zimbabwe  1991  3426.598094              NaN
6605        Zimbabwe  1990  3324.348171              NaN

In [72]:
internet_df.tail(181)

     Country or Area  Year      Value  Value Footnotes
4314         Uruguay  2002  11.419470              NaN
4315         Uruguay  2001  11.121438              NaN
4316         Uruguay  2000  10.539058              NaN
4317         Uruguay  1999   9.972765              NaN
4318         Uruguay  1998   6.987069              NaN
...              ...   ...        ...              ...
4490        Zimbabwe  1997   0.033080              NaN
4491        Zimbabwe  1996   0.016790              NaN
4492        Zimbabwe  1995   0.007684              NaN
4493        Zimbabwe  1994   0.001739              NaN
4494        Zimbabwe  1990   0.000000              NaN

[181 rows x 4 columns]

10. Drop the "value footnotes" column from both DataFrames. Check that this worked as expected.

In [73]:
gdp_df.drop(columns = ['Value Footnotes'], inplace = True)
gdp_df.tail()

     Country or Area  Year        Value
6601        Zimbabwe  1994  3263.934978
6602        Zimbabwe  1993  3033.504852
6603        Zimbabwe  1992  3054.889178
6604        Zimbabwe  1991  3426.598094
6605        Zimbabwe  1990  3324.348171

In [74]:
internet_df.drop(columns = ['Value Footnotes'], inplace = True)
internet_df.tail()

     Country or Area  Year     Value
4490        Zimbabwe  1997  0.033080
4491        Zimbabwe  1996  0.016790
4492        Zimbabwe  1995  0.007684
4493        Zimbabwe  1994  0.001739
4494        Zimbabwe  1990  0.000000

11. Change the columns for the GDP Per Capita DataFrame to ‘Country’, ‘Year’, and ‘GDP_Per_Capita’.

In [75]:
gdp_df = gdp_df.rename(columns = {'Country or Area': 'Country', 'Year' : 'Year', 'Value': 'GDP_Per_Capita'}, inplace = False)

12. Change the columns for the Internet Users DataFrame to ‘Country’, ‘Year’, and ‘Internet_Users_Pct’.

In [76]:
internet_df = internet_df.rename(columns = {'Country or Area': 'Country', 'Year' : 'Year', 'Value': 'Internet_Users_Pct'}, inplace = False)

13. Merge the two DataFrames to one. Merge all rows from each of the two DataFrames. Call the new DataFrame gdp_and_internet_use.

In [77]:
gdp_and_internet_use=gdp_df.merge(internet_df, on=['Country','Year'], how='outer')
gdp_and_internet_use

          Country  Year  GDP_Per_Capita  Internet_Users_Pct
0     Afghanistan  2018     2190.240321                 NaN
1     Afghanistan  2017     2202.570851                 NaN
2     Afghanistan  2016     2200.764487                 NaN
3     Afghanistan  2015     2212.750899                 NaN
4     Afghanistan  2014     2249.253738            6.390000
...           ...   ...             ...                 ...
7659        Yemen  1999             NaN            0.056629
7660        Yemen  1998             NaN            0.023323
7661        Yemen  1997             NaN            0.015025
7662        Yemen  1996             NaN            0.000621
7663        Yemen  1990             NaN            0.000000

[7664 rows x 4 columns]

14 Look at the first five rows of your new DataFrame to confirm it merged correctly.

In [78]:
gdp_and_internet_use.head(5)

       Country  Year  GDP_Per_Capita  Internet_Users_Pct
0  Afghanistan  2018     2190.240321                 NaN
1  Afghanistan  2017     2202.570851                 NaN
2  Afghanistan  2016     2200.764487                 NaN
3  Afghanistan  2015     2212.750899                 NaN
4  Afghanistan  2014     2249.253738                6.39

15. Look at the last five rows to make sure the data is clean and as expected.

In [79]:
gdp_and_internet_use.tail(5)

     Country  Year  GDP_Per_Capita  Internet_Users_Pct
7659   Yemen  1999             NaN            0.056629
7660   Yemen  1998             NaN            0.023323
7661   Yemen  1997             NaN            0.015025
7662   Yemen  1996             NaN            0.000621
7663   Yemen  1990             NaN            0.000000

16.Subset the combined DataFrame to keep only the data for 2004, 2009, and 2014. Check that this happened correctly.

In [80]:
subset_years = gdp_and_internet_use[(gdp_and_internet_use['Year'] == 2004) | (gdp_and_internet_use['Year'] == 2009) | (gdp_and_internet_use['Year'] == 2014)]
subset_years

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
4               Afghanistan  2014     2249.253738            6.390000
9               Afghanistan  2009     1881.777626            3.550000
14              Afghanistan  2004     1284.127338            0.105809
21                  Albania  2014    11828.232264           60.100000
26                  Albania  2009    10528.778102           41.200000
...                     ...   ...             ...                 ...
7627  Virgin Islands (U.S.)  2009             NaN           27.396510
7632  Virgin Islands (U.S.)  2004             NaN           27.377009
7644                  Yemen  2014             NaN           22.550000
7649                  Yemen  2009             NaN            9.960000
7654                  Yemen  2004             NaN            0.881223

[830 rows x 4 columns]

insert Andrew's solution for above with .isin??

This one was a real pain because I left the bottom rows with comments in my data. Andrew and Teresa helped me figure out what weas up.  I tried to use skiprows and skipfooter but he suggested nrows and it worked great. Thanks, Andrew!

In [81]:
subset_years.Year.value_counts()

2014    277
2009    277
2004    276
Name: Year, dtype: int64

17. Create three new DataFrames, one for 2004, one for 2009, and one for 2014. Give them meaningful names that aren't too long.

In [91]:
sub_2004 = subset_years['Year'] == 2004
df_2004 = subset_years[sub_2004]
df_2004

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
14              Afghanistan  2004     1284.127338            0.105809
31                  Albania  2004     7738.542836            2.420388
60                  Algeria  2004     9898.310490            4.634475
89                   Angola  2004     5568.959139            0.464815
118     Antigua and Barbuda  2004    18742.463741           24.266544
...                     ...   ...             ...                 ...
7530     T.F.Y.R. Macedonia  2004             NaN           24.440000
7588              Venezuela  2004             NaN            8.404470
7612               Viet Nam  2004             NaN            7.642409
7632  Virgin Islands (U.S.)  2004             NaN           27.377009
7654                  Yemen  2004             NaN            0.881223

[276 rows x 4 columns]

In [90]:
sub_2009= subset_years['Year'] == 2009
df_2009= subset_years[sub_2009]
df_2009

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
9               Afghanistan  2009     1881.777626             3.55000
26                  Albania  2009    10528.778102            41.20000
55                  Algeria  2009    10610.711405            11.23000
84                   Angola  2009     7610.310423             6.00000
113     Antigua and Barbuda  2009    19989.092913            42.00000
...                     ...   ...             ...                 ...
7525     T.F.Y.R. Macedonia  2009             NaN            51.77000
7583              Venezuela  2009             NaN            32.70000
7607               Viet Nam  2009             NaN            26.55000
7627  Virgin Islands (U.S.)  2009             NaN            27.39651
7649                  Yemen  2009             NaN             9.96000

[277 rows x 4 columns]

In [88]:
sub_2014 = subset_years['Year'] == 2014
df_2014 = subset_years[sub_2014]
df_2014

                    Country  Year  GDP_Per_Capita  Internet_Users_Pct
4               Afghanistan  2014     2249.253738                6.39
21                  Albania  2014    11828.232264               60.10
50                  Algeria  2014    11329.428688               18.09
79                   Angola  2014     8239.832077               21.26
108     Antigua and Barbuda  2014    18104.241470               64.00
...                     ...   ...             ...                 ...
7520     T.F.Y.R. Macedonia  2014             NaN               68.06
7578              Venezuela  2014             NaN               57.00
7602               Viet Nam  2014             NaN               48.31
7622  Virgin Islands (U.S.)  2014             NaN               50.07
7644                  Yemen  2014             NaN               22.55

[277 rows x 4 columns]

18. Which country had the highest percentage of internet users in 2014? What was the percentage? (Try typing the first 3 letters of your DataFrame name and hitting the tab key for auto-complete options).

In [94]:
df_2014[df_2014['Internet_Users_Pct'] == df_2014['Internet_Users_Pct'].max()]

      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2507  Iceland  2014    49911.069825               98.16

19. Which country had the lowest percentage of internet users in 2014? What was the percentage

In [95]:
df_2014[df_2014['Internet_Users_Pct'] == df_2014['Internet_Users_Pct'].min()]

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
6838  Dem. People's Rep. of Korea  2014             NaN                 0.0

20.Repeat for 2004 and 2009.

2004

In [98]:
df_2004[df_2004['Internet_Users_Pct'] == df_2004['Internet_Users_Pct'].max()]

     Country  Year  GDP_Per_Capita  Internet_Users_Pct
5785  Sweden  2004    45029.814344               83.89

In [99]:
df_2004[df_2004['Internet_Users_Pct'] == df_2004['Internet_Users_Pct'].min()]

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
6847  Dem. People's Rep. of Korea  2004             NaN                 0.0

2009

In [100]:
df_2009[df_2009['Internet_Users_Pct'] == df_2009['Internet_Users_Pct'].max()]

      Country  Year  GDP_Per_Capita  Internet_Users_Pct
2512  Iceland  2009    48428.312438                93.0

In [101]:
df_2009[df_2009['Internet_Users_Pct'] == df_2009['Internet_Users_Pct'].min()]

                          Country  Year  GDP_Per_Capita  Internet_Users_Pct
6842  Dem. People's Rep. of Korea  2009             NaN                 0.0

21. Which country had the highest gdp per capita in 2014? What was the gdp per capita?

In [102]:
df_2014[df_2014['GDP_Per_Capita'] == df_2014['GDP_Per_Capita'].max()]

               Country  Year  GDP_Per_Capita  Internet_Users_Pct
3564  Macao SAR, China  2014    156514.13385                 NaN

22. Which country had the lowest gdp per capita in 2014? What was the gdp per capita?

In [103]:
df_2014[df_2014['GDP_Per_Capita'] == df_2014['GDP_Per_Capita'].min()]

                      Country  Year  GDP_Per_Capita  Internet_Users_Pct
983  Central African Republic  2014      822.610458                 NaN